app/controllers/sessions_controller.rb

  def create
    @user = User.find_or_create_by(uid: auth['uid']) do |u|
---
INSERT INTO "users" ("name", "email", "image", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10223890884920567"], ["LIMIT", 1]]